blog4/app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", ""], ["content", ""], ["created_at", "2023-10-21 07:27:37.858226"], ["updated_at", "2023-10-21 07:27:37.858226"]]

  def destroy
    @blog.destroy!
---
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 3]]